1s/ERP/Conf/Catalogs/Лико_Формы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Лико_Формы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПечати</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Лико_ВидыПечати</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЦветаУдалить</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Лико_ТипыЦвета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКраски</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦеновыеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Название</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_Пантоны</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаСписана</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УголПоворотаРастра</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_УглыПоворотаРастра</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказПоРельсе</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТрафаретнаяСетка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_ТрафаретныеСетки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПолимера</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_ВидыПолимеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСекции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_ВидыСекций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пересвет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЦвета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_ТипыЦвета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказТех</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Грамматура</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентЗаливки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДистортФлексо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_ДистортыФлексо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШагПечати</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Площадка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_Площадки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодЛинкс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сплошная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ширина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Длина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолщинаПолимера</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДействияСФормой</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Лико_ДействияСФормой</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Этикетки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

1s/ERP/Conf/Catalogs/Лико_Формы/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область Печать


Функция ПечатьСкладскойКарточки(Форма) Экспорт 
	
	МассивОбъектов = Новый Массив(); 
	МассивОбъектов.Добавить(Форма);
	Возврат  ПечатьЗадания(МассивОбъектов, Неопределено);
		
КонецФункции



// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ПечатьСкладскойКарточки";
	КомандаПечати.Представление = НСтр("ru = 'Печать складской карточки'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;	
	//КомандаПечати.СразуНаПринтер = Истина;	
	
	
	
	
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПечатьСкладскойКарточки") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"ПечатьСкладскойКарточки",
		НСтр("ru = 'Печать складской карточки'"),
		ПечатьЗадания(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;
КонецПроцедуры

Функция ПечатьЗадания(МассивОбъектов, ОбъектыПечати)
	
	КолонкаКодов = ФормированиеПечатныхФорм.ДополнительнаяКолонкаПечатныхФормДокументов().ИмяКолонки;
	ВыводитьКоды = ЗначениеЗаполнено(КолонкаКодов);
	
	
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати = "Лико_ПАРАМЕТРЫ_ПЕЧАТИ_Формы_СкладскаяКарточка";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_Формы.Ссылка КАК Ссылка,
	|	Лико_Формы.Код КАК Код,
	|	""Форма полимерная цифровая"" КАК Наименование,
	|	Лико_Формы.Заказ.Контрагент КАК Контрагент,
	|	"""" КАК Спецификация,
	|	МАКСИМУМ(Лико_ФормыЭтикетки.Номенклатура) КАК Номенклатура
	|ИЗ
	|	Справочник.Лико_Формы КАК Лико_Формы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Лико_Формы.Этикетки КАК Лико_ФормыЭтикетки
	|		ПО Лико_ФормыЭтикетки.Ссылка = Лико_Формы.Ссылка
	|ГДЕ
	|	Лико_Формы.Ссылка В(&МассивОбъектов)
	|
	|СГРУППИРОВАТЬ ПО
	|	Лико_Формы.Ссылка,
	|	Лико_Формы.Код,
	|	Лико_Формы.Заказ.Контрагент
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка";
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	//Нужно напечатать номер и дату накладной, но к накладным может не быть доступа
	УстановитьПривилегированныйРежим(Истина);
	
	Результаты = Запрос.ВыполнитьПакет();
	
	УстановитьПривилегированныйРежим(Ложь);
	
	ВыборкаПоДокументам      = Результаты[0].Выбрать();
	
	РеквизитыДокумента = Новый Структура;
	РеквизитыДокумента.Вставить("КодНоменклатуры");
	РеквизитыДокумента.Вставить("Код");
	РеквизитыДокумента.Вставить("Наименование", "Форма полимерная цифровая");
	РеквизитыДокумента.Вставить("Контрагент");
	РеквизитыДокумента.Вставить("Спецификация");
	РеквизитыДокумента.Вставить("Номенклатура"); 	
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Справочник.Лико_Формы.ПФ_MXL_СкладскаяКарточка");
	
	ОбластьШапка  = Макет.ПолучитьОбласть("Шапка");
	
	
	ПервыйДокумент = Истина;
	
	Пока ВыборкаПоДокументам.Следующий() Цикл  			
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		ЗаполнитьЗначенияСвойств(РеквизитыДокумента, ВыборкаПоДокументам); 		
		ОбластьШапка.Параметры.Заполнить(РеквизитыДокумента);
		ТабличныйДокумент.Вывести(ОбластьШапка);
		
	КонецЦикла;   	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.ПолеСлева 	= 1;
	ТабличныйДокумент.ПолеСправа	= 0;
	ТабличныйДокумент.ПолеСнизу 	= 0;
	ТабличныйДокумент.ПолеСверху 	= 1;
	
	ИмяПринтера = СокрЛП(Справочники.Лико_РабочиеМеста.ПолучитьСвойство("ИмяПринтераДляПечатиА4", ""));
	ТабличныйДокумент.ИмяПринтера = ИмяПринтера; 	
	ТабличныйДокумент.АвтоМасштаб = Истина; 	
	Возврат ТабличныйДокумент;	
КонецФункции

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
		СписокЗначений=Новый СписокЗначений;
	СтандартнаяОбработка=Ложь;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 20
	|	Лико_Формы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Лико_Формы КАК Лико_Формы
	|ГДЕ
	|	Лико_Формы.Код ПОДОБНО &Код";
	Запрос.УстановитьПараметр("Код",Параметры.СтрокаПоиска+"%" );
	СписокЗначений.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
	ДанныеВыбора=СписокЗначений; 	
	// Вставить содержимое обработчика.
	//ПродолжитьВызов(ДанныеВыбора, Параметры, СтандартнаяОбработка);

КонецПроцедуры

#КонецОбласти

#КонецЕсли
